year_tax = int(input())

# • Баскетболни кецове – цената им е 40% по-малка от таксата за една година
# • Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
# • Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
# • Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка

shoes = year_tax - (year_tax * 0.40)
# shoes = year_tax * 0.60 - обратен вариант на горното

suit = shoes - (shoes * 0.20)
ball = suit / 4  # получаваме 1/4 от него
acc = ball / 5

total_expenses = year_tax + suit + ball + acc + shoes

print(total_expenses)
